Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J71.tmx
Source language: en_us
Languages: zh_cn

source: Nappe pressures on gravity dam spillways
zh_cn: 重力坝溢洪道下泄水舌的压力

source: Abstract
zh_cn: 摘要

source: When concrete gravity spillways are required to pass flood flows in excess of their design discharges, the hydrodynamic forces produced by the overflowing nappe can have a large impact on structural stability.
zh_cn: 当混凝土重力坝溢洪道宣泄的洪水流量大于设计洪水流量时，溢流水舌产生的动水压力对坝体结构稳定性有很大影响。

source: This paper discusses a technique for approximating the nappe pressures on spillways of arbitrary shape and determining the effect of these pressures on structural stability.
zh_cn: 对近似计算任意型式溢洪道水舌压力和确定水舌压力对结构稳定性影响的方法进行了讨论。

source: 1 Introduction
zh_cn: 0 概述

source: The stability of a gravity dam is determined by the applied forces.
zh_cn: 重力坝的稳定性取决于作用在坝体上的作用力。

source: The dam's weight and the hydrostatic forces are easily determined.
zh_cn: 大坝重力和静水压力很容易确定。

source: Typically, the force exerted on the dam by the water overflowing it (the nappe force) is usually not large and can be neglected in considering stability.
zh_cn: 一般来说，溢流作用于坝体的力（水舌压力）不大，考虑大坝稳定性时可以忽略不计。

source: However, when gravity spillways pass flood flows in excess of their design discharges, the hydrodynamic force produced by the overflowing nappe becomes more significant with respect to the other forces applied to the dam, and may have a large impact on the structural stability.
zh_cn: 但是，当混凝土重力坝溢洪道需要宣泄大于设计流量的洪水时，与作用于大坝上的其他力相比，溢流水舌产生的动水压力明显要大，因此可能会对坝体结构的稳定性产生很大的影响。

source: This fact is well understood and dam design and regulating entities such as the Corps of Engineers and the Federal Energy Regulatory Commission (FERC) have addressed the phenomenon.
zh_cn: 美国陆军工程师团和联邦能源条例委员会（FERC）等大坝设计和管理机构，已经对该现象作过详细论述。

source: These agencies specify that when considering the stability of a gravity dam spillway, the tailwater height should be assumed to be 60% of the actual tailwater height to account for hydrodynamic effects when flow conditions result in a significant hydraulic jump.
zh_cn: 当考虑重力坝溢洪道的稳定性时，这些管理机构规定在水流条件产生大的水跃时，应该假定下游尾水位为实际尾水位的60%来计算水动力影响。

source: The FERC deals with the evaluation of the stability of existing dams, and since most of these dams were not designed to pass the probable maximum flood (PMF), the FERC has found it necessary to undertake a more rigorous determination of the effects of crest pressures and spillway bucket pressures.
zh_cn: FERC对现有大坝稳定性的评估进行了研究，因为这些大坝的绝大部分不是按照通过可能最大洪（PMF）的条件设计的，因而认为有必要对溢流堰顶压力和溢洪道消力戽压力的影响进行更严格的确定。

source: The current practice of reducing tailwater to 60% of its height for analysis purposes is rather arbitrary.
zh_cn: 为了进行分析，实践中将尾水深减少到其水深的60%的做法是相当不适宜的。

source: When the tailwater depth is significant with respect to the height of the dam, errors introduced by the 60% assumption can have large effects on dam stability.
zh_cn: 当尾水深相对于大坝高度较大时，60%的假设所产生的误差对大坝稳定性可能有很大影响。

source: 2. Determination of Pressures
zh_cn: 1 压力的确定

source: Accurate determination of the nappe pressure requires that flow depth and velocity be known at every point on the surface of the spillway.
zh_cn: 准确确定水舌压力时需要了解溢洪道表面每一点的流速和水深。

source: This problem is very difficult to solve rigorously.
zh_cn: 这个问题很难得到精确的解。

source: The solution that this paper presents relies on the following simplifying assumptions:
zh_cn: 本文介绍的解法取决于下面的几个简化假设：

source: Streamlines are concentric and parallel to the spillway surface and to each other;
zh_cn: 流线同心，互相平行，并平行于溢洪道表面；

source: The curvature of the stream lines changes gradually with respect to distance along the streamline;
zh_cn: 沿流线方向，流线的曲率相对于长度逐渐变化；

source: Flow is irrotational;
zh_cn: 水流无旋运动；

source: Energy is not dissipated by friction or aeration.
zh_cn: 利用摩擦或掺气不能消能。

source: As can be seen in Figure 1, every point in the water jet has an associated pressure and velocity.
zh_cn: 如图1所示，喷射水流每一点都有一个相关的压力和流速。

source: The pressure is a function of the depth beneath the free surface, S, the radius of curvature of the streamline, Rs and the velocity Vs.
zh_cn: 压力是自由水面以下水深S、流线曲率半径Rs和流速Vs的函数。

source: The pressure at any point S is given by:
zh_cn: 任一点S的压力由下式给出：

source: Where p = mass density of water, g = gravitational acceleration, Pt = pressure at S below the free surface, g = integration variable.
zh_cn: 式中ρ为水的密度；g为重力加速度；Ps为自由水面以下S点的压力；ζ为积分变量。

source: The pressure can be expressed in terms of head as follows:
zh_cn: 压力用水头表示如下：

source: The first term in Equation 1 is the hydrostatic head. The second term is the pressure due to centrifugal force caused as the streamline curves about a radius R.
zh_cn: 方程(1)第一项是静水头，第二项是由曲率半径为Rs的流线离心力所产生的压力。

source: The second term may be positive or negative depending on the sign of the radius.
zh_cn: 第二项可正可负，由曲率半径的正负值确定。

source: Figure 1 depicts the positive sign convention of the radius. This is the type of curvature present in a flip bucket.
zh_cn: 图1描述了曲率半径为正值的惯例，这是溢洪道挑流鼻坎的曲率形式。

source: For the case of crest pressure, the radius would be negative and the second term would diminish the pressure head with respect to increasing depth.
zh_cn: 对于堰顶压力，曲率半径应该为负值，第二项水深增加时压力水头会减小。

source: Energy is assumed to be constant with respect to S; therefore, assuming irrotational flow, we can write the following equation:
zh_cn: 假定对于任一点S能量为常数。因此，在无旋流动的假定下，可以得到下面的方程：

source: Where E = total energy, Y = the elevation of the spillway surface at the point in question, A = the depth of flow measured perpendicular to the mean streamline direction.
zh_cn: 式中E为总能量；Y为所考虑点处溢洪道表面的高程；A为垂直于平均流线方向的实测水深。

source: Equation 2 can be differentiated with respect to S, resulting in:
zh_cn: 方程(2)对S微分，得：

source: This differential equation has the following solution:
zh_cn: 此微分方程的解如下：

source: Where R is now the radius of curvature of the dam surface and (R-A+S) is the radius of curvature of the streamline.
zh_cn: 式中R为现在大坝表面的曲率半径；（R-A+S）为流线的曲率半径。

source: The resulting velocity distribution is then:
zh_cn: 则合成流速分布为：

source: Verification of the assumption of irrotational flow
zh_cn: 无旋流动假设的验证

source: Since Equation 2 assumes irrotational flow, it should be shown that the flow field described by Equation 3 is truly irrotational.
zh_cn: 对于方程(2)假设了无旋流动，所以应该证明由方程(3)描述的流场确实是无旋流的。

source: In other words, the change in the radial component of velocity, VR with respect to distance along the stream line is equal the change in the tangential component of velocity, VT with respect to distance perpendicular to the streamline.
zh_cn: 也就是说，径向流速分量VR沿流线随距离的变化应该等于切向流速分量VT沿垂直于流线随距离的变化。

source: Since streamlines were assumed to be concentric, Vr is zero.
zh_cn: 即：因为假定流线是同心的，所以VR为零。

source: However there is a radial acceleration equal to the velocity squared divided by the radius of the streamline, which implies that:
zh_cn: 但是有一个径向加速度，其值为速度的平方除以流线的曲率半径，则：

source: VT is equal to VS, therefore:
zh_cn: VT等于VS，因此：

source: so it can be seen that the velocity field is irrotational.
zh_cn: 因此可以看出，流场是无旋流的。

source: Constraining the velocity field by the unit discharge
zh_cn: 受单位流量约束的流场

source: Since the radius of curvature is the inverse of the curvature k. Equation 3 can be rewritten as follows:
zh_cn: 因为曲率半径R是曲率k的倒数，方程(3)可以变为：

source: At any point on the spillway, the total unit discharge q must be constant.
zh_cn: 在溢洪道的任一点上，总单位流量q必须为常数。

source: Equation 3 can be integrated with respect to S between 0 and A to yield the following equation for q, the unit discharge:
zh_cn: 方程(3)可以对S从O到A进行积分，得到单位流量q的方程如下：

source: Integrating this equation results in the following:
zh_cn: 对该方程积分得：

source: Equation 4 can be derived using intrinsic co-ordinates and the momentum equations for two dimensional flow, as is done in the US Bureau of Reclamation's Engineering Monograph 42, The author prefers the more intuitive derivation presented above.
zh_cn: 方程(4)可以采用内蕴坐标和二维流的动量方程推导，如同美国垦务局的工程专题论文中所进行的推导那样。

source: Equation 4 can be solved for A.
zh_cn: 由方程(4)可以求出A。

source: In this manner the depth of flow, velocity, and pressure head can be determined at every point on the spillway as a function of q, the unit discharge, and k, the spillway surface curvature.
zh_cn: 用这种方式，确定的溢洪道每一点上的水深、流速和压力水头都是单位流量q和溢洪道表面曲率k的函数。

source: In addition, this equation can be differentiated with respect to A and set equal to 0.
zh_cn: 另外，方程(4)可以对A进行微分，并令其值为零。

source: The solution to this equation gives critical depth at the section in question in terms of the energy, elevation and spillway curvature.
zh_cn: 根据能量、高程和溢洪道曲率求解该方程，可以得到所考虑截面上的临界水深。

source: Thus the weir coefficient for the spillway at a given surcharge can be calculated directly.
zh_cn: 因此，可以直接计算给定洪水超高的溢洪道的溢流系数。

source: 3 Limitations
zh_cn: 2 局限性

source: Non-parallel stream lines
zh_cn: 非平行流线

source: All equations presented above were derived assuming that the streamlines of the nappe were parallel to the surface of the dam.
zh_cn: 上面给出的方程都是在假定水舌的流线与大坝表面平行的条件下推导出来的。

source: This is not a bad assumption downstream of the crest.
zh_cn: 这个假设在堰顶下游是适当的。

source: Upstream of the crest, the streamlines are clearly not parallel to the spillway surface, or to each other, therefore a different assumption must be made.
zh_cn: 在堰顶上游，流线明显与溢洪道表面不平行，流线之间也不是互相平行的，因此必须作出一个不同的假设。

source: In Figure 4, the variation of assumed streamline direction can be seen.
zh_cn: 在图2中可以看到假定流线方向的变化。

source: Downstream of the crest, all streamlines are assumed to be parallel to the dam surface.
zh_cn: 在堰顶下游，假定所有的流线和大坝表面平行。

source: Upstream of the crest, all streamlines are assumed to be perpendicular to a line that bisects the angle between the outward directed normal to the spillway surface and to the vertical. This assumption can cause some error.
zh_cn: 在堰顶上游，假定所有的流线垂直于溢洪道平面外法线和垂线所成夹角的平分线，这个假设可能会产生一些误差。

source: Sudden curvature changes
zh_cn: 曲率变化急剧

source: In order to get meaningful results out of this technique, the curvature change from point to point must be gradual.
zh_cn: 为了能用这种方法获得有意义的结果，从一点到另一点的曲率变化应该是渐进的。

source: This is difficult to accomplish upstream of the crest of most spillway sections because typically, the surface changes from a vertical upstream face, which has an infinite radius of curvature, to an elliptical crest with a small radius of curvature. This transition usually happens instantaneously.
zh_cn: 但绝大多数溢洪道的堰顶上游部分不可能做到这样，因为大坝表面从无限大曲率半径的垂直上游面变化到曲率半径很小的椭圆形堰顶，通常是瞬时发生的。

source: Since Equation 4 can be solved at any point on the dam without reference to other points, the water surface and pressure profiles can also have sudden changes as a result of sudden curvature changes. Figure 5 illustrates this problem.
zh_cn: 由于曲率急剧变化，水面线和压力分布也会发生急剧变化。

source: The water surface profile calculated with abrupt curvature changes exhibits unrealistic dips and surges.
zh_cn: 根据曲率急剧变化计算得到的水面曲线存在着不实际的倾角与涌浪。

source: This problem can be overcome by taking into account the fact that while the curvature of the stream lines close to the dam surface may change very quickly, those further away from the dam surface will tend to smooth these curvature changes over.
zh_cn: 解决这个问题考虑了这样的事实，靠近大坝表面的流线曲率变化非常快时，那些距离大坝表面较远的流线的曲率变化则较平稳。

source: This smoothing over can be approximated by curvature averaging.
zh_cn: 可通过曲率平均来近似解流线的平滑问题（见图3）。

source: The results presented in this article are based on curvature averaged between three points as follows:
zh_cn: 本文给出的结果是根据3点的曲率平均确定的。

source: Turbulent flow and air entrainment
zh_cn: 湍流和掺气

source: The solution presented here ignores the fact that as the nappe falls along the surface of the spillway, it becomes air entrained.
zh_cn: 本文给出的解忽略了水舌沿溢洪道表面下泄时水流中会掺气这样一个事实。

source: Also some of the energy is converted to turbulence rather than to increasing velocity.
zh_cn: 而且一部分能量会转化为紊动而不是增加流速。

source: However, the greater the depth of flow, the less air entrainment and turbulent boundary layer considerations matter.
zh_cn: 但是，水流深度越深，掺气湍流边界层的影响就越小。

source: 4 Resulting hydrodynamic forces
zh_cn: 3 合成水动力

source: The net horizontal force Fx on a spillway section can be calculated without knowing anything about the nappe profile or spillway pressure distribution.
zh_cn: 计算溢洪道截面上的净水平力FX，不需要知道水舌截面或溢洪道压力分布的任何情况。

source: The net horizontal force is give by Equation 5.
zh_cn: 净水平力由方程(5)给出：

source: Where y = unit weight of water, DH = depth of headwater a large distance upstream of the dam, DT = depth of tailwater a large distance downstream of the dam
zh_cn: 式中γ为水的容重；DH为大坝上游距离较远处的上游水深；DT为大坝下游距离较远处的尾水深度。

source: Unfortunately, Equation 5 yields no information about the location of the net horizontal force.
zh_cn: 方程(5)并没有给出净水平力作用点的信息。

source: Both the magnitude and location of Fx and Fy, the net vertical force, can be determined with the help of the values from Table 1 since the pressure distribution is completely defined.
zh_cn: 因为压力分布已经完全确定，所以可以确定净水平力FX和净垂直力FY的大小及作用点距坝基的距离Y和距堰顶轴线的距离X。

source: The results of this process are as follows:
zh_cn: 算结果如下：

source: Fx = 1423.3 kN/m, at Y = 6.57m from dam base.
zh_cn: FX = 1 423. 3 kNPm , Y = 6. 57 m。

source: FY = 414.0kN/m, at X= 13.28m from dam crest axis.
zh_cn: FY = 414. 0 kNPm , X = 13. 28 m。

source: Note that Fx obtained by this method is within 0.3% of the value obtained using Equation 5.
zh_cn: 注意，用这种方法获得的FX和方程(5)获得的结果，误差为0.3%。

source: 5 Effect of nappe pressures on spillway stability
zh_cn: 4 水舌压力对溢洪道稳定性的影响

source: To determine the effect of nappe pressures on spillway stability, the section in Figure 2 was analysed for stability using the Corps of Engineers and FERC recommended 60% tailwater reduction, and compared with results of stability analyses including hydrodynamic nappe forces (see Figure 6). The results are shown in Figures 7 and 8.
zh_cn: 为了确定水舌压力对溢洪道稳定性的影响，应用美国工程师团和联邦能源条例委员会推荐的60%的尾水折减对标准反弧形溢洪道剖面进行了分析，并与包括水舌动水压力的稳定分析结果进行了对比。

source: Hydrostatic analysis was done using standard FERC Engineering Guidelines [2] methodology.
zh_cn: 采用联邦能源条例委员会技术指南的标准方法对溢洪道进行了静力分析。

source: Note that the difference between the two methods increases as the discharge increases.
zh_cn: 值得注意的是，这两种方法计算结果的差别随流量的增大而增加。

source: When the spillway is passing design discharge at design head, the two methods begin to diverge significantly.
zh_cn: 当溢洪道在设计水头情况下通过设计洪水时，两种方法计算结果开始有明显的差别。

source: The fact that more friction is required using the standard hydrostatic analysis indicates that the standard hydrostatic method is over-conservative in this case.
zh_cn: 利用标准静力分析需要较大摩擦系数的事实，说明标准静力分析方法在这种情况下过于保守。

source: There is even more difference in the amount of base cracking predicted by the two methods, as can be seen in Figure 8. Again the hydrostatic method proves to be over-conservative in this example.
zh_cn: 两种方法预测的基础裂缝值有更大的差别，再次说明静力方法过于保守。

source: The hydrostatic method predicts that base cracking will occur at lower reservoir elevations, and will progress faster with respect to increasing head.
zh_cn: 静力学方法预测基础裂缝在较低库水位情况下发生，而且随着水头的增加裂缝扩展较快。

source: Conclusion
zh_cn: 5 结论

source: The standard practice of ignoring crest and bucket pressures and downgrading the tailwater height by a factor of 0.6 can introduce significant error.
zh_cn: 忽略堰顶和挑流鼻坎压力以及通过乘以0.6的折减系数降低尾水水深的标准操作规程可能使计算结果产生很大的误差。

source: In situations where a spillway section is being surcharged above the design head of the section, hydrodynamic effects should be considered in the stability analysis.
zh_cn: 当溢洪道下泄超过设计水头的洪水时，稳定分析应考虑水动力影响。

source: The standard hydrostatic approach which is typically used in current practice, and which is currently in the FERC Engineering Guidelines [2] begins to produce significant errors as the discharge surpasses the design discharge.
zh_cn: 实践中通常采用的是静力学方法，以及联邦能源条例委员会技术指南，但当溢洪道泄洪量超过设计流量时，这种方法开始产生较大的误差。

source: In this example, the error was on the conservative side.
zh_cn: 本例中，误差偏于保守。

source: However, this may not be the case in all situations.
zh_cn: 但并不是说在所有情况下都是这样。
